Autodesk.Revit.DB.SaveOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.SaveOptions.Compact
Default is false: let the OS eliminate as much or as little dead data as it wants to.
True: force the OS to eliminate all dead data from the file on disk.
Since:
2014

Autodesk.Revit.DB.SaveOptions.PreviewViewId
The view id that will be used to generate the preview; this id is not saved to the document's permanent settings.
Remarks:
If this id is set, the indicated view will be used to generate the preview even if
DocumentPreviewSettings.PreviewViewId is also set.
The id must be valid for use as a preview view (check DocumentPreviewSettings.IsViewIdValidForPreview()).
Revit does not check validity when setting this value, only when the options are used in a call to SaveAs().
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.SaveOptions.#ctor
Default constructor.
Remarks:
PreviewViewId will be InvalidElementId.
Since:
2012

Autodesk.Revit.DB.SaveOptions
This class contains options available for saving a document to disk.
Since:
2012